[
    {
        "Title": "The Bidder's Alley",
        "date": "08-01-2025",
        "time": "N/A",
        "location": "IIT Delhi",
        "summary": "The Indian Game Theory Society (IGTS), IIT Delhi, hosts \"The Bidder's Alley,\" a live auction event featuring modified virtual auctions.  Top teams from online prelims advance to the final offline round.  It's a chance to test strategic skills and enjoy friendly competition.",
        "target_audience": "Strategists, thrill-seekers, seasoned bidders, and those curious about auctions."
    },
    {
        "Title": "Rendezvous 2024",
        "date": "N/A",
        "time": "N/A",
        "location": "IIT Delhi (various venues including Open Air Theater (OAT) and Nalanda ground)",
        "summary": "Rendezvous 2024, a mega-cultural event at IIT Delhi, successfully concluded.  The event featured over 200 events, performances by professional artists, and activities across various venues.  The organizing team expresses gratitude for the support and participation of the IITD community.",
        "target_audience": "IIT Delhi students, faculty, staff, alumni, sponsors, and Institute functionaries."
    },
    {
        "Title": "Rendezvous '24: Melange Pronite",
        "date": "08-10-2024",
        "time": "17:00",
        "location": "Open Air Theater (OAT) and Nalanda Ground, IIT Delhi",
        "summary": "Guidelines for Day 3 evening program of Rendezvous '24.  Melange pronite (Salim Sulaiman) at OAT requires a valid pass and original IITD ID card.  Alternative musical performances at Nalanda Ground with entry via original IITD ID card. Entry to both venues may be restricted once capacity is reached.",
        "target_audience": "IIT Delhi students, faculty, staff, and their families (with restrictions)."
    },
    {
        "Title": "Rendezvous '24: Day 3 - A Spirited Masquerade",
        "date": "08-10-2024",
        "time": "11:00",
        "location": "IIT Delhi (Open Air Theater (OAT) and Nalanda Ground)",
        "summary": "Instructions for Day 3 of Rendezvous '24.  Melange pronite passes bookable from 11:00 AM to 1:00 PM via the website.  Entry to OAT requires a valid pass and original IITD ID card.  Alternative events at Nalanda Ground with entry via original IITD ID card.  Children under 12 not allowed in OAT.",
        "target_audience": "IIT Delhi students, faculty, and permanent staff."
    },
    {
        "Title": "Rendezvous '24: Dhoom Pronite",
        "date": "07-10-2024",
        "time": "17:00",
        "location": "Open Air Theater (OAT) and Nalanda Ground, IIT Delhi",
        "summary": "Guidelines for Day 2 evening program of Rendezvous '24. Dhoom pronite (Mithoon) at OAT requires a valid pass and original IITD ID card. Alternative musical performances at Nalanda Ground with entry via original IITD ID card. Entry to both venues may be restricted once capacity is reached.",
        "target_audience": "IIT Delhi students, faculty, staff, and their families (with restrictions)."
    },
    {
        "Title": "Rendezvous '24: Day 2 - A Spirited Masquerade",
        "date": "07-10-2024",
        "time": "11:00",
        "location": "IIT Delhi (Open Air Theater (OAT) and Nalanda Ground)",
        "summary": "Instructions for Day 2 of Rendezvous '24. Dhoom pronite passes bookable from 11:00 AM to 1:00 PM via the website. Entry to OAT requires a valid pass and original IITD ID card. Alternative events at Nalanda Ground with entry via original IITD ID card. Children under 12 not allowed in OAT.",
        "target_audience": "IIT Delhi students, faculty, and permanent staff."
    },
    {
        "Title": "Rendezvous '24: Kaleidoscope Pronite",
        "date": "06-10-2024",
        "time": "17:00",
        "location": "Open Air Theater (OAT) and Nalanda Ground, IIT Delhi",
        "summary": "Instructions for Day 1 evening program of Rendezvous '24. Kaleidoscope pronite (Asees Kaur) at OAT requires a valid pass and original IITD ID card.  Alternative events at Nalanda Ground (band, dance finals, DJ) with entry via original IITD ID card. Entry to both venues may be restricted once capacity is reached.",
        "target_audience": "IIT Delhi students, faculty, staff, and their families (with restrictions)."
    },
    {
        "Title": "N/A",
        "date": "06-10-2024",
        "time": "N/A",
        "location": "N/A",
        "summary": "N/A",
        "target_audience": "N/A"
    },
    {
        "Title": "Rendezvous '24 Pronite Pass Booking",
        "date": "05-10-2024",
        "time": "10:00",
        "location": "Open Air Theater (OAT) and Nalanda Grounds, IIT Delhi",
        "summary": "Announcing the artist lineup and pass booking schedule for Rendezvous '24 pronites (Oct 5-8).  Pass booking opens October 5th at 10 AM via the website.  Details on entry requirements, security protocols, and alternative events at Nalanda Grounds are included.",
        "target_audience": "IIT Delhi students, faculty, and staff."
    },
    {
        "Title": "Rendezvous '24: A Spirited Masquerade",
        "date": "05-10-2024",
        "time": "10:00",
        "location": "IIT Delhi (Open Air Theater (OAT), Seminar Hall, LH121, Ex Hall, Dogra Hall, and other venues)",
        "summary": "Instructions for Rendezvous '24 (October 5-8).  The event features various activities, including music, dance, drama, and workshops.  OAT events (Blitzkrieg, pronites) require passes, bookable from October 5th at 10 AM.  Details on pass booking and restrictions are provided. Children under 12 are not allowed in the OAT.",
        "target_audience": "IIT Delhi students, faculty, and staff."
    },
    {
        "Title": "Rendezvous '24: A Spirited Masquerade",
        "date": "05-10-2024",
        "time": "N/A",
        "location": "IIT Delhi (LHC, Open Air Theater (OAT), Dogra Hall, Seminar Hall, Nalanda Ground)",
        "summary": "Announcing Rendezvous '24 (October 5-8), a cultural extravaganza at IIT Delhi.  Day 1 events include quizzes, debates, creative activities, and a talk show.  Pronite passes are available for booking via the Rendezvous website.  Instructions for website registration are provided.",
        "target_audience": "IIT Delhi community (students, faculty, staff)."
    },
    {
        "Title": "Tryst 2024 Day 3 Technite",
        "date": "31-03-2024",
        "time": "17:00",
        "location": "Open Air Theatre (OAT), IIT Delhi",
        "summary": "Invitation to Day 3 Technite of Tryst 2024, featuring musical performances by Karan Kanchan and Divine.  Registration is required via the Tryst website and Slick app.  Entry requires a pass and IIT Delhi RFID card.  Entry gates open at 5:00 PM and close at 6:30 PM.",
        "target_audience": "IIT Delhi students, staff, and faculty."
    },
    {
        "Title": "Tryst 2024 Day 2 Technite",
        "date": "30-03-2024",
        "time": "17:00",
        "location": "Open Air Theatre (OAT), IIT Delhi",
        "summary": "Invitation to Day 2 Technite of Tryst 2024, featuring stand-up comedian Samay Raina and DJ Ravator. Registration is required via the Tryst website and Slick app. Pass booking opens at 8:00 AM. Entry requires a pass and likely an IIT Delhi ID card. Entry gates open at 5:00 PM and close at 6:30 PM.",
        "target_audience": "IIT Delhi students, staff, and faculty."
    },
    {
        "Title": "Literati 2024",
        "date": "N/A",
        "time": "N/A",
        "location": "IIT Delhi",
        "summary": "Literati 2024, IIT Delhi's annual literature and arts festival, features over 50 events, keynote speakers (Kaveree Bamzai, Bahar Dutt, Rajeev Sethi), panel discussions, competitions (quizzes, word games), workshops, and closing night performances (mushaira, theatre, slam poetry, stand-up comedy).",
        "target_audience": "Literature and language lovers, journalism enthusiasts, media and art aficionados."
    },
    {
        "Title": "Literati '25 Recruitment",
        "date": "18-10-2024",
        "time": "N/A",
        "location": "N/A",
        "summary": "The Board for Student Publications (BSP), IIT Delhi, is recruiting Core Team Members (CTMs) for Literati '25 across various verticals: Marketing, Events, Competitions, Media & Production, Creative, Publicity, and Admin & Finance.  Interested individuals should fill out the provided Google Form by October 18th.",
        "target_audience": "IIT Delhi students interested in arts, literature, and event management."
    },
    {
        "Title": "Chhath Puja Celebration",
        "date": "06-11-2024",
        "time": "19:00",
        "location": "Kalyan Mandapam, IIT Delhi",
        "summary": "Invitation to the Chhath Puja celebration at Kalyan Mandapam, IIT Delhi.  The event includes Kharna Prasad (November 6th, 7:00 PM), evening Arghya (November 7th, sunset), morning Arghya (November 8th, sunrise), and Prasad distribution (November 8th, 7-8 AM).  Contact information for volunteers is provided.",
        "target_audience": "IIT Delhi community and families."
    },
]
