[
    {
        "Title": "The Bidder's Alley",
        "date": "08-01-2025",
        "time": "N/A",
        "location": "IIT Delhi",
        "summary": "The Indian Game Theory Society (IGTS), IIT Delhi, hosts \"The Bidder's Alley,\" a live auction event featuring modified virtual auctions.  Top teams from online prelims advance to an offline final round.  The event combines strategy, excitement, and friendly competition.",
        "target_audience": "Strategists, thrill-seekers, seasoned bidders, and those curious about auctions.",
        "Tags": [
            "Business",
            "Academic"
        ]
    },
    {
        "Title": "Rendezvous 2024",
        "date": "N/A",
        "time": "N/A",
        "location": "IIT Delhi",
        "summary": "Rendezvous 2024, a mega-cultural event at IIT Delhi, successfully concluded.  The event featured over 200 events, performances by professional artists, and activities at various locations including the Open Air Theater and Nalanda ground.  The organizing team expressed gratitude for the support of the IITD community.",
        "target_audience": "IIT Delhi students, faculty, staff, alumni, sponsors, and Institute functionaries.",
        "Tags": [
            "Cultural"
        ]
    },
    {
        "Title": "Rendezvous '24: Melange Pronite",
        "date": "08-10-2024",
        "time": "17:00",
        "location": "Open Air Theater (OAT), IIT Delhi (and Nalanda Ground)",
        "summary": "Guidelines for Day 3 evening program of Rendezvous '24.  Melange (Salim Sulaiman) at OAT requires a valid pass and original IITD ID.  Alternative musical performances at Nalanda Ground with entry via original IITD ID. Entry to both venues may be restricted once capacity is reached.",
        "target_audience": "IIT Delhi students, faculty, staff, and their families (with restrictions).",
        "Tags": [
            "Cultural",
            "Entertainment"
        ]
    },
    {
        "Title": "Rendezvous '24: Day 3 - A Spirited Masquerade",
        "date": "08-10-2024",
        "time": "17:00",
        "location": "Open Air Theater (OAT), IIT Delhi (and Nalanda Ground)",
        "summary": "Instructions for Day 3 of Rendezvous '24.  Melange pronite passes available 11:00-13:00 via website registration.  OAT entry requires a valid pass and original IITD ID card.  Alternative events at Nalanda Ground with entry via original IITD ID card.  Children under 12 not permitted in OAT.",
        "target_audience": "IIT Delhi students, faculty, and staff.",
        "Tags": [
            "Cultural",
            "Entertainment"
        ]
    },
    {
        "Title": "Rendezvous '24: Dhoom Pronite",
        "date": "07-10-2024",
        "time": "17:00",
        "location": "Open Air Theater (OAT), IIT Delhi (and Nalanda Ground)",
        "summary": "Guidelines for Day 2 evening program of Rendezvous '24. Dhoom pronite at OAT requires a valid pass and original IITD ID. Alternative musical performances at Nalanda Ground with entry via original IITD ID. Entry to both venues may be restricted once capacity is reached.",
        "target_audience": "IIT Delhi students, faculty, staff, and their families (with restrictions).",
        "Tags": [
            "Cultural",
            "Entertainment"
        ]
    },
    {
        "Title": "Rendezvous '24: Day 2 - A Spirited Masquerade",
        "date": "07-10-2024",
        "time": "11:00",
        "location": "Open Air Theater (OAT), IIT Delhi (and Nalanda Ground)",
        "summary": "Instructions for Day 2 of Rendezvous '24. Dhoom pronite passes bookable 11:00-13:00 via website registration. OAT entry requires a valid pass and original IITD ID card. Alternative events at Nalanda Ground with entry via original IITD ID card. Children under 12 not permitted in OAT.",
        "target_audience": "IIT Delhi students, faculty, and staff.",
        "Tags": [
            "Cultural",
            "Entertainment"
        ]
    },
    {
        "Title": "Rendezvous '24: Kaleidoscope Pronite",
        "date": "N/A",
        "time": "17:00",
        "location": "Open Air Theater (OAT), IIT Delhi (and Nalanda Ground)",
        "summary": "Instructions for the first Rendezvous '24 pronite, Kaleidoscope (Asees Kaur), at the OAT. Entry requires a valid pass and original IITD ID card.  Alternative events at Nalanda Ground (band, dance finals, DJ) with entry via original IITD ID card. Entry to both venues may be restricted once capacity is reached.",
        "target_audience": "IIT Delhi students, faculty, and staff.",
        "Tags": [
            "Cultural",
            "Entertainment"
        ]
    },
    {
        "Title": "Rendezvous '24: Pronite Artist Reveal and Pass Booking",
        "date": "05-10-2024",
        "time": "10:00",
        "location": "Open Air Theater (OAT), IIT Delhi (and Nalanda Grounds)",
        "summary": "Announcing the artist lineup and pass booking schedule for Rendezvous '24 pronites (Oct 5-8).  Pass booking opens October 5th at 10:00 AM via website registration.  Details on entry requirements, security protocols, and alternative events at Nalanda Grounds are included.",
        "target_audience": "IIT Delhi students, faculty, and staff.",
        "Tags": [
            "Cultural",
            "Entertainment"
        ]
    },
    {
        "Title": "Rendezvous '24: A Spirited Masquerade",
        "date": "05-10-2024",
        "time": "10:00",
        "location": "IIT Delhi (OAT, Dogra Hall, LH121, Seminar Hall, Ex Hall, Nalanda Grounds)",
        "summary": "Invitation to Rendezvous '24 (October 5-8), a cultural extravaganza at IIT Delhi.  The event includes various activities, performances, and discussions.  OAT events (Blitzkrieg, pronites) require passes; booking details to follow.  Other events are listed; children under 12 not allowed in OAT.",
        "target_audience": "IIT Delhi community (students, faculty, staff).",
        "Tags": [
            "Cultural",
            "Entertainment"
        ]
    },
    {
        "Title": "Rendezvous '24: A Spirited Masquerade",
        "date": "05-10-2024",
        "time": "N/A",
        "location": "IIT Delhi (LHC, OAT, Dogra Hall, Seminar Hall, Nalanda Ground)",
        "summary": "Announcing Rendezvous '24 (October 5-8), a multi-day cultural event at IIT Delhi.  Day 1 events include quizzes, debates, creative activities, and a talk show at LHC;  OAT events, Alumni panel talk and Kavi Sammelan at Dogra Hall, Western Group Dance Prelims at Seminar Hall, and a Prom Night at Nalanda Ground.  Pronite pass booking instructions are provided.",
        "target_audience": "IIT Delhi community.",
        "Tags": [
            "Cultural",
            "Entertainment"
        ]
    },
    {
        "Title": "Tryst 2024: Day 3 Technite",
        "date": "31-03-2024",
        "time": "17:00",
        "location": "Open Air Theatre (OAT), IIT Delhi",
        "summary": "Invitation to Day 3 Technite of Tryst 2024, featuring musical performances by Karan Kanchan and Divine.  Registration is required via the Tryst website and Slick app.  Entry requires a pass and IIT Delhi RFID card; entry gates close at 18:30. Separate entry points for males and females.",
        "target_audience": "IIT Delhi students, staff, and faculty.",
        "Tags": [
            "Entertainment"
        ]
    },
    {
        "Title": "Tryst 2024: Day 2 Technite",
        "date": "30-03-2024",
        "time": "17:00",
        "location": "Open Air Theatre (OAT), IIT Delhi",
        "summary": "Invitation to Day 2 Technite of Tryst 2024, featuring stand-up comedian Samay Raina and DJ Ravator. Registration is required via the Tryst website and Slick app. Pass booking opens at 08:00 AM; entry requires a pass and closes at 18:30.",
        "target_audience": "IIT Delhi students, staff, and faculty.",
        "Tags": [
            "Entertainment"
        ]
    },
    {
        "Title": "Literati 2024",
        "date": "N/A",
        "time": "N/A",
        "location": "IIT Delhi",
        "summary": "Literati 2024, IIT Delhi's annual literature and arts festival, features over 50 events under the theme \"Words Across Borders.\"  Keynote speakers include Kaveree Bamzai, Bahar Dutt, and Rajeev Sethi.  Panel discussions, competitions (quizzes, storytelling, etc.), workshops, and closing night performances (mushaira, theatre, slam poetry, stand-up comedy) are planned.",
        "target_audience": "Literature and language lovers, journalism enthusiasts, media and art aficionados.",
        "Tags": [
            "Cultural",
            "Academic"
        ]
    },
    {
        "Title": "Literati '25 Recruitment",
        "date": "N/A",
        "time": "N/A",
        "location": "N/A",
        "summary": "The Board for Student Publications (BSP), IIT Delhi, is recruiting Core Team Members (CTMs) for Literati '25, its annual art and literature festival.  Applications are open for various verticals (Marketing, Events, Competitions, Media & Production, Creative, Publicity, Admin & Finance). The application deadline is October 18th.",
        "target_audience": "IIT Delhi students interested in arts, literature, and event management.",
        "Tags": [
            "Cultural"
        ]
    },
    {
        "Title": "Literati 2024 Closing Night Ceremony",
        "date": "N/A",
        "time": "18:00",
        "location": "Dogra Hall, IIT Delhi",
        "summary": "Literati 2024 closing night events at Dogra Hall:  Annual Lecture by Rajeev Sethi (18:00), followed by a stand-up comedy act by Rahul Dua and Delhi Slam Poetry (19:00). Entry is first-come, first-served, starting at 17:30 and closing at 18:30 or when the hall is full.  IIT Delhi ID cards are required; bags and water bottles are prohibited; recording is not allowed.",
        "target_audience": "IIT Delhi students, faculty, and staff.",
        "Tags": [
            "Cultural",
            "Entertainment"
        ]
    },
    {
        "Title": "Civil Engineering Seminar: Professor Prashant Kumar",
        "date": "23-12-2024",
        "time": "10:30",
        "location": "Committee Room (Block IV; Room No. 221), Department of Civil Engineering, IIT Delhi",
        "summary": "A Civil Engineering seminar by Professor Prashant Kumar (University of Surrey) on \"Unlocking the Potential of Nature-Based Solutions for Air Pollution and Climate Mitigation.\" The seminar will discuss air pollution disparities, nature-based solutions, exposure control strategies, and policy changes. Professor Kumar's extensive research and awards will also be highlighted.",
        "target_audience": "Civil engineering students, faculty, researchers, and professionals.",
        "Tags": [
            "Academic",
            "Technology"
        ]
    },
    {
        "Title": "Khelculus: Mathematics Department Sports Event",
        "date": "07-04-2024",
        "time": "N/A",
        "location": "Mittal sports complex",
        "summary": "The Mathematics Society invites you to Khelculus, a sports event featuring cricket, basketball, volleyball, football (pending registration), table tennis, carom, chess, Jenga, and other fun games.  Registration is required via provided Google Forms links before April 6th.",
        "target_audience": "Mathematics department students and colleagues.",
        "Tags": [
            "Sports"
        ]
    },
    {
        "Title": "Sportech'25 CTM Recruitment",
        "date": "N/A",
        "time": "N/A",
        "location": "N/A",
        "summary": "Recruitment for Core Team Members (CTMs) of Sportech'25, IIT Delhi's annual sports fest, is open.  Interested students (UG 2022 entry and prior; PG 2nd year and onwards) can apply via the provided Google Form link by January 7th, 2024.  CTMs will lead teams and coordinate event processes.",
        "target_audience": "IIT Delhi students interested in sports management.",
        "Tags": [
            "Sports",
            "Business"
        ]
    },
    {
        "Title": "Code-Decode Programming Competition",
        "date": "19-10-2024",
        "time": "18:00",
        "location": "LH108",
        "summary": "Code-Decode is a unique programming competition where participants reverse-engineer algorithms from given inputs and outputs.  The competition challenges problem-solving and analytical skills.  Prizes worth Rs. 5000 are offered to winners. Registration is via the provided Google Form link.",
        "target_audience": "IIT Delhi students interested in programming and problem-solving.",
        "Tags": [
            "Technology"
        ]
    },
    {
        "Title": "Physics and Astronomy Reading Circle: Introduction to Astrophysics",
        "date": "19-10-2024",
        "time": "18:00",
        "location": "WS101 (Design Dept.), IIT Delhi",
        "summary": "The Physics and Astronomy Club invites you to a weekly reading circle on Introduction to Astrophysics.  The event provides a platform for students to discuss in-depth topics.  Future topics and presenters are decided during the session.  A WhatsApp group link is provided for further communication.",
        "target_audience": "IIT Delhi students interested in physics and astronomy.",
        "Tags": [
            "Academic"
        ]
    },
    {
        "Title": "Castillo Cuantico: AI/ML in Quantitative Finance",
        "date": "20-10-2024",
        "time": "12:45",
        "location": "LH121, IIT Delhi",
        "summary": "Castillo Cuantico, hosted by Citadel Securities and ARIES, IIT Delhi, is an offline session and competition focusing on AI/ML in quantitative finance.  The event includes a talk, trading/market-making competition, and a data challenge.  Prizes and goodies are offered; registration is required via the provided link.  IITD students only.",
        "target_audience": "IIT Delhi students interested in AI/ML, quantitative finance, and trading.",
        "Tags": [
            "Technology",
            "Business"
        ]
    },
    {
        "Title": "Piramal Finance ML Hackathon",
        "date": "16-10-2024",
        "time": "17:30",
        "location": "Lecture Hall Complex, IIT Delhi",
        "summary": "Piramal Finance is hosting an ML hackathon exclusively for IIT Delhi students.  The event is open to both UG and PG students, regardless of coding experience.  Registration is via the provided HackerEarth link.  The hackathon will take place in the Lecture Hall Complex.",
        "target_audience": "IIT Delhi undergraduate and postgraduate students.",
        "Tags": [
            "Technology",
            "Business"
        ]
    },
    {
        "Title": "Robocon Hackathon: Robot Basketball",
        "date": "25-12-2024",
        "time": "N/A",
        "location": "N/A",
        "summary": "The Robotics Club, IIT Delhi, is hosting a Robot Basketball Hackathon inspired by the ABU Robocon 2025 theme.  Participants design and submit a CAD model of a robot, along with a design explanation document.  Teams of up to three are allowed.  Prizes include a 15K prize pool and wildcard entries to Team Robocon IITD.  The submission deadline is December 25th, 2024.",
        "target_audience": "IIT Delhi students interested in robotics.",
        "Tags": [
            "Technology"
        ]
    },
    {
        "Title": "By The Chai - A Lohri Open Mic",
        "date": "12-01-2025",
        "time": "17:00",
        "location": "Red Square Area (Near Central Library), IIT Delhi",
        "summary": "By The Chai is a Lohri-themed open mic event featuring musical performances and poetry.  Organized by Music Club, Literary Club, Hindi Samiti, and Literati, the event is open to performers and audience members.  Registration is required via the provided Google Form link by January 11th.",
        "target_audience": "IIT Delhi students and community members interested in music, poetry, and cultural events.",
        "Tags": [
            "Cultural",
            "Entertainment"
        ]
    },
    {
        "Title": "Chhath Puja Celebration",
        "date": "06-11-2024",
        "time": "19:00",
        "location": "Kalyan Mandapam, IIT Delhi",
        "summary": "The Chhath Puja Samiti, Sri Hari Satsang Sabha, IIT Delhi, invites you to the annual Chhath Puja celebration at Kalyan Mandapam.  The event includes Kharna Prasad (November 6th, 19:00), evening Arghya (November 7th, sunset), morning Arghya (November 8th, sunrise), and Prasad distribution (November 8th, 07:00-08:00).",
        "target_audience": "IIT Delhi community and families.",
        "Tags": [
            "Cultural"
        ]
    }
]
